var local_database = [
    {
        date: "Jan 25 2016",
        title: "正是蟹肥虾壮时",
        imgSrc: '/images/post/crab.png',
        avatar: "/images/avatar/1.png",
        content: "“山明水净夜来霜，数树深红出浅黄。试上高楼清入骨，岂如春色嗾人狂。”金秋时节，天高云淡，秋风送爽，气候宜人。秋风秋阳中，硕果坠挂枝头，玉米抚须含笑",
        detail:"“山明水净夜来霜，数树深红出浅黄。试上高楼清入骨，岂如春色嗾人狂。”金秋时节，天高云淡，秋风送爽，气候宜人。秋风秋阳中，硕果坠挂枝头，玉米抚须含笑，高粱引颈高歌，豆荚饱满圆润。棉桃鼓胀欲裂，水稻灌浆初熟，世间万物经过春的孕育，夏的生长，即将抵达收获的季节。在这瓜果飘香、稻黍起舞的召唤声中，又是一度蟹肥虾壮时。<\n\n地处黄海之滨的小城，在秋风的抚慰、秋阳的光照下，瞬间也喧嚣起来。任意走进城中的每一个菜市场，在显眼的位置上，冲入耳际的是此起彼伏的吆喝声，映入眼帘的是那些小商小贩们抢占有利地势将一只只塑料箱一字排开的情景。浅箱中，健壮的对虾、竹节虾在水中跳跃，舒展着弯曲的身体；深箱中，一贯横行霸道的螃蟹拥挤在狭小的空间里，相互肆意践踏，有些不甘蜗居的螃蟹，顺着笔直的箱壁艰难地攀爬着，虽经百般努力，终以失败而告终。那些聚集在网兜里的螃蟹，更是不甘寂寞，身体被束缚着无法动弹，便利用可以自由呼吸的嘴巴，于窸窸窣窣中不停地吐着一串串泡沫，以示抗议，也以此证明自己是个活物。特别是那些个头较大的螃蟹，仿佛知道自己的身价不菲，为此，更是气宇轩昂，自以为是。也许，它们是得到垂青和恩宠的一类吧，受到了特别的眷顾，活动的空间相对较大，所以也更加肆无忌惮。只要有人试图靠近，便会举着那两只肥硕的大螯向你示威，仿佛在警告你：别碰我，否则休怪我无礼！",
        author:"幽兰萦梦",
        publishTime:"24小时前",
        reading: "92",
        collection: "65",
        postid:0,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E061FF02C31F716658E5C81F5594D561F2E88B854E81CAAB7806D5E4F103E55D33C16F3FAC506D1AB172DE8600B37E43FAD&fromtag=46',
            title: '许巍：此时此刻 ',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R300x300M000003rsKF44GyaSk.jpg?max_age=2592000'
            }
    },
    {
        date: "Nav 26 2016",
        title: "你的世界我最美",
        imgSrc: '/images/post/cat.png',
        avatar: "/images/avatar/2.png",
        content: "如果非得用一种“非人类”来抽象的形容那份伟大的爱，我会选择槐花，为什么？也许它没有玫瑰花的艳丽，没有牡丹的高贵，但它充满我对妈妈的记忆。每当家乡槐花盛开的时候，我总会闻到独特的芳香，它平日可见却不令人疲劳，总会给我一种清新脱俗的感觉。",
        detail:"如果非得用一种“非人类”来抽象的形容那份伟大的爱，我会选择槐花，为什么？也许它没有玫瑰花的艳丽，没有牡丹的高贵，但它充满我对妈妈的记忆。每当家乡槐花盛开的时候，我总会闻到独特的芳香，它平日可见却不令人疲劳，总会给我一种清新脱俗的感觉。\n\n家门前有一棵槐树，是我出生那年，母亲栽上的，后来也时不时拿我的身高跟这棵树比较。儿时的夏天，蝉声鸣鸣，树上浓绿的叶子渲染着童年的活力，闷热的空气中却总是会有一股清凉，那时的自己，喜欢跟小朋友，在树下阴凉地、房屋墙影下玩耍，槐花的香气充满儿时的记忆。小孩子嘛，不知哪里来的一股劲，玩耍起来就不知疲倦，夸张一点，可以嗨三天三夜不停歇。\n\n某天，我在玩伴的家中玩耍，母亲当时说回家做点槐花糕，过会儿来接我，刚开始我跟伙伴一起在玩小木偶，过了一会儿，忘记是谁提出的好点子，我们就偷偷溜去田地里挖野菜，跑到场地，开挖，当时并不认识挖的什么菜，现在想想也许是苦菜、荠菜等等，小孩子嘛，纯属玩，并不是所谓的劳动，没有疲倦反倒“乐”乎所以，于是我们忘记了时间去了哪。中午，田野里劳作的人都回家吃饭了，一望无际的田地里只留下我跟小伙伴在专心的‘劳作’。突然，渐渐传来的一声声熟悉的喊叫打破了我们的专注，多年后，我依旧清晰的记得那个憔悴的背影……她越走越近，没错，就是我那大嗓门，如河东狮吼般的母亲，不记得当时她是哪副模样，惶恐？责备？宠爱？随后意料中的一批痛训，握着显得更为稚嫩的一双小手回到了家……那是我从母亲眼中第一次看见泪花，年幼的我吓哭了。回家后，她急忙拿出刚做好的槐花糕，不记得当时吃了几个，只记得好多，好香。",
        author:"六竹小生",
        publishTime:"两分钟前",
        reading: "92",
        collection: "65",
        postid:1,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38',
            title: '谭咏麟：朋友',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000'
            }
    },
    {
        date: "Feb 21 2016",
        title: "比利·林恩的中场战事",
        imgSrc: '/images/post/bl.png',
        avatar: "/images/avatar/3.png",
        content: "《比利·林恩的中场战事》是由美国索尼电影娱乐公司发行，由李安执导，乔·阿尔文、克里斯汀·斯图尔特、克里斯·塔克、加内特·赫德兰联合主演剧情片。《比利·林恩的中场战事》根据本·芳汀同名小说改编。",
        detail:"《比利·林恩的中场战事》是一个非常文艺片手法的心理剧，平行剪辑随林恩对现场的反应走，不知道下一场戏是什么，你也不知道下一场戏主人公在何方，而这就是李安所擅长的。所以说，与技术相对而言，观众看到的仍是以前那个热衷于细节的李安。每个插叙的画面都有细节做串联，电影里，中场演出进行时，这群面临过生死存亡的人走出舞台，烟雾喷出，士兵们被吓得惊慌失措。而画面也会切到战场上硝烟四起。还有林恩独自站在真命天女组合后面，前面是万众快乐，而身后是战场上生死离别的悲伤。\n\n英雄的归处只有战场。他们不再属于和平。电影里除了士兵们之外，所有人物几乎都在消解英雄这个词语。电影经纪人、球场管理者、到林恩的姐姐、再到拉拉队的女孩，他们眼中的林恩打从一开始就不是与自己在同一个世界的，所以在这个基础上产生的一切感情只能结束于现实世界。电影延续了李安一贯的善意与不安，最后还是悲情满满。真理或谎言，都无法概括这个世界，残酷与温暖并存，关怀与孤独同在。[23]  （腾讯娱乐评）\n\n《比利·林恩的中场战事》原著小说是通过一个19岁男孩的眼睛看周遭的世界，描写他的想法和感受。在导演的120帧4K 3D的镜头里，感同身受得到了最大化地体现。导演用了不少人物的主观视角，在电影里两个大场面，球赛中场表演和伊拉克战场上，这种用120帧4K 3D拍成的主观镜头一下子让观众成为了比利·林恩。甚至有的观众认为诟病120帧因为过于清晰，呈现在大银幕上反而会造成不真实感。但事实，无论是锣鼓喧天的球赛中场还是枪林弹雨的伊拉克战场，虽然都是真实发生的现实，却又超出了日常生活景象，用来呈现比利·林恩的视角，简直是锦上添花。",
        author:"李安",
        publishTime:"一天前",
        reading: "92",
        collection: "65",
        postid:2,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38',
            title: '齐秦：夜夜夜夜',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000'
            }
    },
    {
        date: "May 10 2016",
        title: "微信小程序安装指南和注意事项",
        imgSrc: '/images/wx.png',
        avatar: "/images/avatar/4.png",
        content: "本文档将带你一步步创建完成一个微信小程序，并可以在手机上体验该小程序的实际效果。这个小程序的首页将会显示欢迎语以及当前用户的微信头像，点击头像，可以在新开的页面中查看当前小程序的启动日志",
        detail:"1. 获取微信小程序的 AppID\n\n登录 https://mp.weixin.qq.com ，就可以在网站的“设置”-“开发者设置”中，查看到微信小程序的 AppID 了，注意不可直接使用服务号或订阅号的 AppID 。注意：如果要以非管理员微信号在手机上体验该小程序，那么我们还需要操作“绑定开发者”。即在“用户身份”-“开发者”模块，绑定上需要体验该小程序的微信号。本教程默认注册帐号、体验都是使用管理员微信号。\n\n《比利·林恩的中场战事》原著小说是通过一个19岁男孩的眼睛看周遭的世界，描写他的想法和感受。在导演的120帧4K 3D的镜头里，感同身受得到了最大化地体现。导演用了不少人物的主观视角，在电影里两个大场面，球赛中场表演和伊拉克战场上，这种用120帧4K 3D拍成的主观镜头一下子让观众成为了比利·林恩。甚至有的观众认为诟病120帧因为过于清晰，呈现在大银幕上反而会造成不真实感。但事实，无论是锣鼓喧天的球赛中场还是枪林弹雨的伊拉克战场，虽然都是真实发生的现实，却又超出了日常生活景象，用来呈现比利·林恩的视角，简直是锦上添花。",
        author:"张小龙",
        publishTime:"亮天前",
        reading: "92",
        collection: "105",
        postid:3,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38',
            title: '李宗盛：鬼迷心窍',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000'
            }
    },
    {
        date: "May 10 2016",
        title: "从触觉手套到触觉衣",
        imgSrc: '/images/vr.png',
        avatar: "/images/avatar/5.png",
        content: "本文档将带你一步步创建完成一个微信小程序，并可以在手机上体验该小程序的实际效果。这个小程序的首页将会显示欢迎语以及当前用户的微信头像，点击头像，可以在新开的页面中查看当前小程序的启动日志",
        detail:"1. 获取微信小程序的 AppID\n\n登录 https://mp.weixin.qq.com ，就可以在网站的“设置”-“开发者设置”中，查看到微信小程序的 AppID 了，注意不可直接使用服务号或订阅号的 AppID 。注意：如果要以非管理员微信号在手机上体验该小程序，那么我们还需要操作“绑定开发者”。即在“用户身份”-“开发者”模块，绑定上需要体验该小程序的微信号。本教程默认注册帐号、体验都是使用管理员微信号。\n\n《比利·林恩的中场战事》原著小说是通过一个19岁男孩的眼睛看周遭的世界，描写他的想法和感受。在导演的120帧4K 3D的镜头里，感同身受得到了最大化地体现。导演用了不少人物的主观视角，在电影里两个大场面，球赛中场表演和伊拉克战场上，这种用120帧4K 3D拍成的主观镜头一下子让观众成为了比利·林恩。甚至有的观众认为诟病120帧因为过于清晰，呈现在大银幕上反而会造成不真实感。但事实，无论是锣鼓喧天的球赛中场还是枪林弹雨的伊拉克战场，虽然都是真实发生的现实，却又超出了日常生活景象，用来呈现比利·林恩的视角，简直是锦上添花。",
        author:"张小龙",
        publishTime:"亮天前",
        reading: "92",
        collection: "105",
        postid:4,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
            title: '万晓利：女儿情',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
            }
    },
    {
        date: "May 10 2016",
        title: "创维&&爱奇艺发布会",
        imgSrc: '/images/iqiyi.png',
        avatar: "/images/avatar/5.png",
        content: "本文档将带你一步步创建完成一个微信小程序，并可以在手机上体验该小程序的实际效果。这个小程序的首页将会显示欢迎语以及当前用户的微信头像，点击头像，可以在新开的页面中查看当前小程序的启动日志",
        detail:"1. 获取微信小程序的 AppID\n\n登录 https://mp.weixin.qq.com ，就可以在网站的“设置”-“开发者设置”中，查看到微信小程序的 AppID 了，注意不可直接使用服务号或订阅号的 AppID 。注意：如果要以非管理员微信号在手机上体验该小程序，那么我们还需要操作“绑定开发者”。即在“用户身份”-“开发者”模块，绑定上需要体验该小程序的微信号。本教程默认注册帐号、体验都是使用管理员微信号。\n\n《比利·林恩的中场战事》原著小说是通过一个19岁男孩的眼睛看周遭的世界，描写他的想法和感受。在导演的120帧4K 3D的镜头里，感同身受得到了最大化地体现。导演用了不少人物的主观视角，在电影里两个大场面，球赛中场表演和伊拉克战场上，这种用120帧4K 3D拍成的主观镜头一下子让观众成为了比利·林恩。甚至有的观众认为诟病120帧因为过于清晰，呈现在大银幕上反而会造成不真实感。但事实，无论是锣鼓喧天的球赛中场还是枪林弹雨的伊拉克战场，虽然都是真实发生的现实，却又超出了日常生活景象，用来呈现比利·林恩的视角，简直是锦上添花。",
        author:"张小龙",
        publishTime:"亮天前",
        reading: "92",
        collection: "105",
        postid:5,
        music:{
            dataUrl: 'http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38',
            title: '老狼：恋恋风尘',
            coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000'
            }
    },
]
//alt + shift + f 格式化代码

module.exports = {
    post_data:local_database
}